app/controllers/mashup_sandbox_controller.rb

  def index
    # This creates the map object, which will be placed inside a DIV with id "map_div"
    @map = GMap.new("map")

    @locations = Location.find(:all)

    #geocode the locations
    @locations.each do |location|
        loc = MultiGeocoder.geocode(location.address)
        Location.update(location.id, :lat => loc.lat, :lng => loc.lng)
---
SELECT * FROM `locations` WHERE (`locations`.`id` = 1)
SELECT * FROM `locations`
UPDATE `locations` SET `updated_at` = '2010-04-30 04:48:52', `lat` = 35.18753, `lng` = -106.483973 WHERE `id` = 1